Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (Conv2D)         (None, 128, 128, 32)      28832     
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 16)      4624      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 16)      2320      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 16)      2320      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 128, 8)       1160      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 128, 8)       584       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 128, 128, 4)       292       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 128, 128, 2)       74        
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 128, 128, 1)       19        
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
=================================================================
Total params: 58,721
Trainable params: 58,721
Non-trainable params: 0
_________________________________________________________________
Training examples: 1000
Batch size: 100
Epochs: 3
Learning rate: 0.001
Average accuracy over 100 testing sequences: -0.42342240296039485
Average difference over 100 testing sequences: 33.13413007776515