Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (Conv2D)         (None, 128, 128, 64)      57664     
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 128, 64)      36928     
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 128)     73856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 128)     147584    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 32)      36896     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 8)       2312      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 128, 4)       292       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 128, 1)       37        
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
=================================================================
Total params: 355,569
Trainable params: 355,569
Non-trainable params: 0
_________________________________________________________________
Training examples: 1000
Batch size: 100
Epochs: 3
Learning rate: 0.001
Average accuracy over 100 testing sequences: 0.0
Average difference over 100 testing sequences: 8.891293248016728