Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (Conv2D)         (None, 128, 128, 32)      28832     
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 64)      18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 64)      36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 8)       4616      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 128, 4)       292       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 128, 1)       37        
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
=================================================================
Total params: 107,697
Trainable params: 107,697
Non-trainable params: 0
_________________________________________________________________
Training examples: 1000
Batch size: 100
Epochs: 10
Learning rate: 0.001
Average accuracy over 100 testing sequences: -0.5851021165692741
Average difference over 100 testing sequences: 9.26109617869139