Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (Conv2D)         (None, 128, 128, 64)      57664     
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 128, 64)      36928     
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 64)      36928     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 32)      18464     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 32)      9248      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 128, 16)      4624      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 128, 8)       1160      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 128, 128, 4)       292       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 128, 128, 1)       37        
_________________________________________________________________
flatten (Flatten)            (None, 16384)             0         
=================================================================
Total params: 174,593
Trainable params: 174,593
Non-trainable params: 0
_________________________________________________________________
Training examples: 1000
Batch size: 100
Epochs: 3
Learning rate: 0.01
Average accuracy over 100 testing sequences: -0.4420609917726924
Average difference over 100 testing sequences: 31.33587513392483